#pragma once

#include "stm32_f20x_f21x_conf.h"

#ifdef MODULE_RCC

/**********************************************************************
 * Область enum class-ов.
 **********************************************************************/

/*
 * Позиции битовых полей внутрирегистра pllcfg модуля RCC.
 */
enum class EC_PLLCFG_REG_BIT_FIELD_POSITION {
    M   = 0,            // PLLM     [5:0].
    N   = 6,            // PLLN     [14:6]
    P   = 16,           // PLLP     [17:16]
    S   = 22,           // PLLSRC   22
    Q   = 24            // PLLQ     [27:24]
};

/**********************************************************************
 * Область упакованных структур.
 **********************************************************************/

/*
 * Перечень регистров физического порта ввода-вывода.
 */
struct __attribute__( ( packed ) ) pll_cfg_struct {
    const uint32_t                pllcfg_reg_msk;
};

#endif
